ProgessBase/Catalogs/УЗ_ПоказателиАнализаСебестоимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>УЗ_ПоказателиАнализаСебестоимости</Name>
			<Comment>Управление запасами</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСтатьиКуб</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CodePL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтатьиЗатрат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ProgessBase/Catalogs/УЗ_ПоказателиАнализаСебестоимости/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоГруппа Тогда
		//Проверим чтобы указанные статьи больше ничего не использовались в спрвочнике
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("СтатьиЗатрат", СтатьиЗатрат.ВыгрузитьКолонку("СтатьяЗатрат"));
		Запрос.УстановитьПараметр("Ссылка", Ссылка); 
		
		Запрос.Текст = "ВЫБРАТЬ
		                |	УЗ_ПоказателиАнализаСебестоимостиСтатьиЗатрат.Ссылка,
		                |	УЗ_ПоказателиАнализаСебестоимостиСтатьиЗатрат.СтатьяЗатрат
		                |ИЗ
		                |	Справочник.УЗ_ПоказателиАнализаСебестоимости.СтатьиЗатрат КАК УЗ_ПоказателиАнализаСебестоимостиСтатьиЗатрат
		                |ГДЕ
		                |	НЕ УЗ_ПоказателиАнализаСебестоимостиСтатьиЗатрат.Ссылка = &Ссылка
		                |	И УЗ_ПоказателиАнализаСебестоимостиСтатьиЗатрат.СтатьяЗатрат В (&СтатьиЗатрат)";
		Результат = Запрос.Выполнить().Выбрать();
		Пока Результат.Следующий() Цикл
			ОбщегоНазначения.СообщитьОбОшибке("Статья затрат " + СокрЛП(Результат.СтатьяЗатрат) + " уже указана в элементе " + СокрЛП(Результат.Ссылка), Отказ);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
